bond-intelligence/api/app/Models/LeadScoreModel.php

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `ls`.*, `a`.`name`, `a`.`agency_type`, `a`.`state`, `a`.`city`, `a`.`website`, MAX(bm.bond_amount) as bond_amount, MAX(bm.election_date) as latest_election
FROM `lead_scores` `ls`
JOIN `agencies` `a` ON `a`.`id` = `ls`.`agency_id`
LEFT JOIN `bond_measures` `bm` ON `bm`.`agency_id` = `a`.`id`
GROUP BY `ls`.`id`
) CI_count_all_results
SELECT `ls`.*, `a`.`name`, `a`.`agency_type`, `a`.`state`, `a`.`city`, `a`.`website`, MAX(bm.bond_amount) as bond_amount, MAX(bm.election_date) as latest_election
FROM `lead_scores` `ls`
JOIN `agencies` `a` ON `a`.`id` = `ls`.`agency_id`
LEFT JOIN `bond_measures` `bm` ON `bm`.`agency_id` = `a`.`id`
GROUP BY `ls`.`id`
ORDER BY `ls`.`score` DESC
 LIMIT 25
---
    public function getLeads(array $filters = [], int $page = 1, int $perPage = 25): array
    {
        $builder = $this->db->table('lead_scores ls')
            ->select('ls.*, a.name, a.agency_type, a.state, a.city, a.website,
                      MAX(bm.bond_amount) as bond_amount, MAX(bm.election_date) as latest_election')
            ->join('agencies a', 'a.id = ls.agency_id')
            ->join('bond_measures bm', 'bm.agency_id = a.id', 'left')
            ->groupBy('ls.id');

        if (!empty($filters['state']))             $builder->where('a.state', $filters['state']);
        if (!empty($filters['agency_type']))       $builder->where('a.agency_type', $filters['agency_type']);
        if (!empty($filters['opportunity_stage'])) $builder->where('ls.opportunity_stage', $filters['opportunity_stage']);
        if (!empty($filters['approach_now']))      $builder->where('ls.approach_now', 1);
        if (!empty($filters['min_score']))         $builder->where('ls.score >=', (int)$filters['min_score']);
        if (!empty($filters['search']))            $builder->like('a.name', $filters['search']);

        $sort = $filters['sort'] ?? 'score';
        $dir  = ($filters['direction'] ?? 'desc') === 'asc' ? 'ASC' : 'DESC';
        $sortMap = ['score' => 'ls.score', 'bond_amount' => 'bond_amount', 'name' => 'a.name'];
        $builder->orderBy($sortMap[$sort] ?? 'ls.score', $dir);

        $total   = $builder->countAllResults(false);
        $results = $builder->limit($perPage, ($page - 1) * $perPage)->get()->getResultArray();