bond-intelligence/api/app/Models/ProcurementEventModel.php

SELECT `pe`.*, `a`.`name` as `agency_name`, `a`.`state`, `a`.`agency_type`
FROM `procurement_events` `pe`
LEFT JOIN `agencies` `a` ON `a`.`id` = `pe`.`agency_id`
WHERE `pe`.`event_type` IN ('rfq_issued','rfp_issued')
AND (`pe`.`due_date` IS NULL OR `pe`.`due_date` >= "2026-06-27")
ORDER BY `pe`.`due_date` ASC
---
    public function getActive(): array
    {
        return $this->db->table('procurement_events pe')
            ->select('pe.*, a.name as agency_name, a.state, a.agency_type')
            ->join('agencies a', 'a.id = pe.agency_id', 'left')
            ->whereIn('pe.event_type', ['rfq_issued','rfp_issued'])
            ->where('(pe.due_date IS NULL OR pe.due_date >= "' . date('Y-m-d') . '")')
            ->orderBy('pe.due_date', 'ASC')
            ->get()->getResultArray();