bond-intelligence/api/app/Models/ScrapeRunModel.php

SELECT *
FROM `scrape_runs`
ORDER BY `started_at` DESC
 LIMIT 50
---
    public function getRecent(int $limit = 50): array
    {
        return $this->orderBy('started_at', 'DESC')->limit($limit)->findAll();