bond-intelligence/api/app/Controllers/Api/DashboardController.php

    public function summary()
    {
        $db = \Config\Database::connect();

        $totalAgencies = $db->table('agencies')->countAllResults();

        $totalBondValue = (float) ($db->table('bond_measures')
            ->selectSum('bond_amount')->get()->getRow()->bond_amount ?? 0);

        $bondsPassedCount = $db->table('bond_measures')
            ->where('result', 'passed')->countAllResults();

        $approachNowCount = $db->table('lead_scores')
            ->where('approach_now', 1)->countAllResults();

        $topOpportunities = $db->table('lead_scores ls')
            ->select('ls.agency_id, a.name as agency_name, ls.score, ls.opportunity_stage as stage, MAX(bm.bond_amount) as bond_amount, a.state')
            ->join('agencies a', 'a.id = ls.agency_id')
            ->join('bond_measures bm', 'bm.agency_id = a.id', 'left')
            ->groupBy('ls.agency_id')
            ->orderBy('ls.score', 'DESC')
            ->limit(5)->get()->getResultArray();

        $pipelineByStage = $db->table('lead_scores')
            ->select('opportunity_stage, COUNT(*) as count')
            ->groupBy('opportunity_stage')
            ->get()->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `agencies`
SELECT SUM(`bond_amount`) AS `bond_amount`
FROM `bond_measures`
SELECT COUNT(*) AS `numrows`
FROM `bond_measures`
WHERE `result` = 'passed'
SELECT COUNT(*) AS `numrows`
FROM `lead_scores`
WHERE `approach_now` = 1
SELECT `ls`.`agency_id`, `a`.`name` as `agency_name`, `ls`.`score`, `ls`.`opportunity_stage` as `stage`, MAX(bm.bond_amount) as bond_amount, `a`.`state`
FROM `lead_scores` `ls`
JOIN `agencies` `a` ON `a`.`id` = `ls`.`agency_id`
LEFT JOIN `bond_measures` `bm` ON `bm`.`agency_id` = `a`.`id`
GROUP BY `ls`.`agency_id`
ORDER BY `ls`.`score` DESC
 LIMIT 5
SELECT `opportunity_stage`, COUNT(*) as count
FROM `lead_scores`
GROUP BY `opportunity_stage`

            $pipelineMap[$row['opportunity_stage'] ?? 'unknown'] = (int)$row['count'];
        }

        $bondsByState = $db->table('bond_measures bm')
            ->select('a.state, SUM(bm.bond_amount) as total_value, COUNT(DISTINCT a.id) as count')
            ->join('agencies a', 'a.id = bm.agency_id')
            ->groupBy('a.state')
            ->orderBy('total_value', 'DESC')
            ->get()->getResultArray();

        $recentRuns = $db->table('scrape_runs')
            ->orderBy('started_at', 'DESC')
            ->limit(5)->get()->getResultArray();
---
SELECT `a`.`state`, SUM(bm.bond_amount) as total_value, COUNT(DISTINCT a.id) as count
FROM `bond_measures` `bm`
JOIN `agencies` `a` ON `a`.`id` = `bm`.`agency_id`
GROUP BY `a`.`state`
ORDER BY `total_value` DESC
SELECT *
FROM `scrape_runs`
ORDER BY `started_at` DESC
 LIMIT 5