bond-intelligence/api/app/Controllers/Api/ScrapeRunController.php

INSERT INTO `scrape_runs` (`scraper_name`, `state`, `started_at`, `status`, `created_at`, `updated_at`) VALUES ('ballotpedia', NULL, '2026-06-26 19:53:49', 'running', '2026-06-26 19:53:49', '2026-06-26 19:53:49')
---
    public function trigger()
    {
        $body = $this->jsonBody();
        $scraper = $body['scraper'] ?? '';
        $state   = $body['state'] ?? null;

        $valid = ['cdiac', 'tx_brb', 'ballotpedia', 'procurement'];
        if (!in_array($scraper, $valid)) {
            return api_error('Invalid scraper. Valid: ' . implode(', ', $valid), 400);
        }

        $model = new ScrapeRunModel();
        $id    = $model->insert([
            'scraper_name' => $scraper,
            'state'        => $state,
            'started_at'   => date('Y-m-d H:i:s'),
            'status'       => 'running',
        ]);